app/Controllers/Karyawan.php

    public function index()
    {
        $modelKaryawan = new KaryawanModel();
        $karyawan = $modelKaryawan->findAll();
---
SELECT *
FROM `karyawan`
WHERE `karyawan`.`deleted_at` IS NULL

    public function show($id = null)
    {
        if ($this->request->isAJAX()){
            $modelKaryawan = new KaryawanModel();
            $karyawan      = $modelKaryawan->find($id);
---
SELECT *
FROM `karyawan`
WHERE `karyawan`.`deleted_at` IS NULL
AND `karyawan`.`id` = '21'

    public function new()
    {
        if ($this->request->isAJAX()) {

            $modelKaryawan = new KaryawanModel();
            $karyawan = $modelKaryawan->findAll();
---
SELECT *
FROM `karyawan`
WHERE `karyawan`.`deleted_at` IS NULL

    public function edit($id = null)
    {
        if ($this->request->isAJAX()){
            $modelKaryawan = new KaryawanModel();
            $karyawan      = $modelKaryawan->find($id);
---
SELECT *
FROM `karyawan`
WHERE `karyawan`.`deleted_at` IS NULL
AND `karyawan`.`id` = '21'

                'no_telp' => $this->request->getPost('no_telp'),
                'email' => $this->request->getPost('email'),
            ];
            $modelKaryawan->save($data);
---
UPDATE `karyawan` SET `deleted_at` = '2023-03-08 15:20:02', `updated_at` = '2023-03-08 15:20:02'
WHERE `id` IN ('21')
AND `deleted_at` IS NULL

    public function delete($id = null)
    {
        $modelKaryawan = new KaryawanModel();
        $modelUser = new UserModel();

        $modelKaryawan->delete($id);
        $modelUser->where(['id_karyawan'=>$id])->delete();
---
UPDATE `users` SET `deleted_at` = '2023-03-08 15:20:02', `updated_at` = '2023-03-08 15:20:02'
WHERE `id_karyawan` = '21'
AND `deleted_at` IS NULL