app/Controllers/Supplier.php

SELECT *
FROM `supplier_link`
WHERE `id_supplier` = '2'
SELECT *
FROM `supplier_cs`
WHERE `id_supplier` = '2'
SELECT *
FROM `provinsi`
ORDER BY `nama`
---
    public function edit($id = null)
    {
        $modelSupplier = new SupplierModel();
        $modelSupplierPJ = new SupplierPJModel();
        $modelSupplierAlamat = new SupplierAlamatModel();
        $modelSupplierLink = new SupplierLinkModel();
        $modelSupplierCs = new SupplierCsModel();
        $modelProvinsi = new ProvinsiModel();
        $modelUser = new UserModel();

        $supplier = $modelSupplier->getSuppliersWithAdmins($id);
        $pj = $modelSupplierPJ->getPJBySupplier($id);
        if ($pj) {
            $users = $modelUser->getUserPJWithKaryawanName(array_column($pj, 'id_user'));
        } else {
            $users = $modelUser->getAllUserWithKaryawanName();
        }
        $alamat = $modelSupplierAlamat->getAlamatBySupplier($id);
        $link = $modelSupplierLink->where(['id_supplier' => $id])->findAll();
        $customer_service = $modelSupplierCs->where(['id_supplier' => $id])->findAll();
        $provinsi = $modelProvinsi->orderBy('nama')->findAll();