app/Models/CustomerModel.php

SELECT `customer`.*, GROUP_CONCAT(karyawan.nama_lengkap SEPARATOR ", <br> ") as admin, GROUP_CONCAT(users.id SEPARATOR ", ") as id_admin
FROM `customer`
LEFT JOIN `customer_penanggungjawab` ON `customer`.`id` = `customer_penanggungjawab`.`id_customer`
LEFT JOIN `users` ON `customer_penanggungjawab`.`id_user` = `users`.`id`
LEFT JOIN `karyawan` ON `users`.`id_karyawan` = `karyawan`.`id`
WHERE `customer`.`deleted_at` IS NULL
GROUP BY `customer`.`id`
ORDER BY `customer`.`id` DESC
---
    public function getCustomers()
    {
        $data =  $this->db->table($this->table)
            ->select('customer.*, GROUP_CONCAT(karyawan.nama_lengkap SEPARATOR ",<br> ") as admin, GROUP_CONCAT(users.id SEPARATOR ", ") as id_admin')
            ->join('customer_penanggungjawab', 'customer.id = customer_penanggungjawab.id_customer', 'left')
            ->join('users', 'customer_penanggungjawab.id_user = users.id', 'left')
            ->join('karyawan', 'users.id_karyawan = karyawan.id', 'left')
            ->where('customer.deleted_at', null)
            ->groupBy('customer.id')
            ->orderBy('customer.id', 'desc')
            ->get()
            ->getResultArray();