app/Models/UserModel.php

    public function getAllUserWithKaryawanName()
    {
        $data =  $this->db->table($this->table)
            ->select('users.id, karyawan.nama_lengkap as nama')
            ->join('karyawan', 'users.id_karyawan = karyawan.id')
            ->get()
            ->getResultArray();
---
SELECT `users`.`id`, `karyawan`.`nama_lengkap` as `nama`
FROM `users`
JOIN `karyawan` ON `users`.`id_karyawan` = `karyawan`.`id`